AcDbEdgeRef.evaluateAndCacheGeometry
Calls evaluateCurve() and replaces the current constant AcGeCurve3d* with the
newly evaluated curve.

AcDbEdgeRef.createEntity
Creates a new non-database resident AcDbEntity from then data the AcDbEdgeRef
holds, and returns it to the caller. The caller is responsible for deleting
the entity after it is no more needed.

AcDbEdgeRef.evaluateCurve(AcGeCurve3d**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Evaluates the curve from the referenced entity geometry. If no entity
is referenced, returns the cached curve. The caller is responsible for
deleting the returned AcGeCurve3d*

AcDbEdgeRef.curve
Returns the constant AcGeCurve3d* that the AcDbEdgeRef may hold.

AcDbEdgeRef.faceSubentId
Returns the optional face AcDbSubentId of one of the faces adjacent to the
referenced edge.

AcDbEdgeRef.setFaceSubentity(AcDbSubentId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The AcDbEdgeRef can also hold AcDbSubentId of a face subentity. The face
needs to bounded by the referenced edge subentity. The additional face
information is needed in cases like when an edge shared by two adjacent
faces is referenced and used for a smooth blend operation. It needs to
be known which face to use to create the smooth blend to.

AcDbEdgeRef.#ctor(AcGeCurve3d!System.Runtime.CompilerServices.IsConst*)
The constructor makes the AcDbEdgeRef keep the AcGeCurve3d.

AcDbEdgeRef.#ctor(AcDbEntity!System.Runtime.CompilerServices.IsConst*)
The constructor makes the AcDbEdgeRef keep the AcDbObjectId of the given
AcDbEntity. Moreover, if the entity is derived from AcDbCurve, it obtains
a copy of the AcGeCurve3d and keeps in it the AcDbEdgeRef.

AcDbEdgeRef.#ctor(AcDbFullSubentPath!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates AcDbEdgeRef from an entity in a block table record
and referenced via a path of block inserts.

AcDbEdgeRef.#ctor(AcDbCompoundObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSubentId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbSubentId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeCurve3d!System.Runtime.CompilerServices.IsConst*)
The constructor sets the data members of the AcDbEdgeRef.

AcDbEdgeRef.#ctor
Default constructor.

AcDbEdgeRef
Reference to an edge, i.e. a subentity whose geometry is a simple curve.
It may either be the whole entity that itself is a single curve, kEdgeSubentType
subentity of an entity, or a constant AcGeCurve3d. Notice that this reference
is generally non-persistent, because it uses transient AcDbSubentId.
The option to reference the whole entity is questionable and has been provided
just for the compatibility with old code that takes the whole entity. We should
probably always represent edges by kEdgeSubentType subentities of entities, even
if the whole entity is just a single edge, such as line, arc, or circle.